//
//  ConversationClass.swift
//  TimeTravel
//
//  Created by 楊宗翰 on 2017/4/27.
//  Copyright © 2017年 TimeTravel. All rights reserved.
//

import UIKit

class ConversationClass: NSObject {
    
    static let talk0 = [
        "這裡是...哪裡?",
        "我的名字是? 想不起來...",
        "你是我的親人嗎?",
        "可以帶我去尋找父母嗎?",
        "你知道要怎麼找回記憶嗎?",
        "知道有關於我的事情嗎?",
        "這是我本來居住的世界嗎?",
        "還是什麼都想不起來...",
        "我為什麼會失去記憶呢?",
        "你是怎麼找到我的呢?",
        "還是什麼都想不起來..."
    ]
    
    static let talk1 = [
        "終於想起一點回憶了...",
        "這邊的世界果然不是我原本居住的地方呢",
        "上次回憶中兩人的臉似曾相識 是我認識的人嗎?",
        "謝謝你帶我出去尋找記憶",
        "回憶中的房間是我的房間嗎?",
        "去晃晃吧?",
        "知道有關於我的事情嗎?"
    ]
    
    static let talk2 = [
        "記憶一點一點的找回來了",
        "記憶中的那兩個人是我的父母親吧",
        "出去走走尋找記憶吧！",
        "唔...總覺得在哪裡看過這種食物"
    ]
    
    static let talk3 = [
        "跟我一起在車上的人不知道怎麼樣了呢",
        "上次回憶中的車速非常的快 一定是很要緊的事",
        "要不要去逛逛其他地方?",
        "記憶..記憶..去哪裡能找到記憶碎片?",
        "有沒有別件衣服能讓我替換呢?"
    ]
    
    static let talk4 = [
        "黑煙... 閃光... 是煙火嗎",
        "壟罩著天空的黑煙是哪裡來的?",
        "同一件衣服穿的有點久了 想換一件！",
        "睡覺的時候夢到螢火蟲了呢"
    ]
    
    static let talk5 = [
        "想要一件新衣服！",
        "要快點把記憶都回想起來！",
        "出門去晃晃如何?",
        "地震好可怕啊！"
    ]
    
    static let talk6 = [
        "嗯..奇怪的裝置是做什麼用的?",
        "去尋找記憶碎片吧！",
        "為什麼父母要哭呢?",
        "出去走走吧！",
        "吶吶，買件新衣服給我穿吧！"
    ]
    
    static let talk7 = [
        "原來的世界不知道怎麼樣了...",
        "....再也見不到父母親了",
        "出門去逛逛吧！",
        "多虧有你的幫忙才能讓我想起記憶",
        "只要看見那張照片就會想起之前的生活..."
    
    ]
}
